### Terraform Plan

<details>
<summary>Click to see the plan</summary>

```
[command]/home/runner/work/_temp/3bc6b8c5-4362-4873-baa5-f2e4220db6f9/terraform-bin show -no-color tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.ecs_service.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.ecs_service.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:us-east-1:654654485498:service/hello-world-api-cluster/hello-world-api-service"
        name                               = "hello-world-api-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:2" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_service.aws_ecs_task_definition.main will be created
  + resource "aws_ecs_task_definition" "main" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::654654485498:role/hello-world-api-execution-role"
      + family                   = "hello-world-api"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + track_latest             = false
    }

  # module.load_balancer.aws_lb_listener.https[0] will be created
  + resource "aws_lb_listener" "https" {
      + arn               = (known after apply)
      + certificate_arn   = "arn:aws:acm:us-east-1:654654485498:certificate/9c80b230-1593-44c4-ae1c-56eea6fe8ffa"
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:654654485498:loadbalancer/app/hello-world-api-alb/e5c80950ca5bfd6e"
      + port              = 443
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-2016-08"
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:654654485498:targetgroup/hello-world-api-tg/feeb4478cc4dc18f"
          + type             = "forward"
        }

      + mutual_authentication (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs_service.data.aws_region.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_region" "current" {%0A      + description = (known after apply)%0A      + endpoint    = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A    }%0A%0A  # module.ecs_service.aws_ecs_service.main will be updated in-place%0A  ~ resource "aws_ecs_service" "main" {%0A        id                                 = "arn:aws:ecs:us-east-1:654654485498:service/hello-world-api-cluster/hello-world-api-service"%0A        name                               = "hello-world-api-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:us-east-1:654654485498:task-definition/hello-world-api:2" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs_service.aws_ecs_task_definition.main will be created%0A  + resource "aws_ecs_task_definition" "main" {%0A      + arn                      = (known after apply)%0A      + arn_without_revision     = (known after apply)%0A      + container_definitions    = (known after apply)%0A      + cpu                      = "256"%0A      + execution_role_arn       = "arn:aws:iam::654654485498:role/hello-world-api-execution-role"%0A      + family                   = "hello-world-api"%0A      + id                       = (known after apply)%0A      + memory                   = "512"%0A      + network_mode             = "awsvpc"%0A      + requires_compatibilities = [%0A          + "FARGATE",%0A        ]%0A      + revision                 = (known after apply)%0A      + skip_destroy             = false%0A      + tags_all                 = (known after apply)%0A      + track_latest             = false%0A    }%0A%0A  # module.load_balancer.aws_lb_listener.https[0] will be created%0A  + resource "aws_lb_listener" "https" {%0A      + arn               = (known after apply)%0A      + certificate_arn   = "arn:aws:acm:us-east-1:654654485498:certificate/9c80b230-1593-44c4-ae1c-56eea6fe8ffa"%0A      + id                = (known after apply)%0A      + load_balancer_arn = "arn:aws:elasticloadbalancing:us-east-1:654654485498:loadbalancer/app/hello-world-api-alb/e5c80950ca5bfd6e"%0A      + port              = 443%0A      + protocol          = "HTTPS"%0A      + ssl_policy        = "ELBSecurityPolicy-2016-08"%0A      + tags_all          = (known after apply)%0A%0A      + default_action {%0A          + order            = (known after apply)%0A          + target_group_arn = "arn:aws:elasticloadbalancing:us-east-1:654654485498:targetgroup/hello-world-api-tg/feeb4478cc4dc18f"%0A          + type             = "forward"%0A        }%0A%0A      + mutual_authentication (known after apply)%0A    }%0A%0APlan: 2 to add, 1 to change, 0 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```
</details>